Vectorking-50kg/s3-rlcd-deck/firmware/sdkconfig.defaults
# ESP-IDF 6.0.2 project defaults for Waveshare ESP32-S3-RLCD-4.2.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
